import 'server-only'

export const educationDict = {
  학력_이름: {
    ko: '이름',
    en: 'Name',
    zh: '学校',
    ja: '学校',
  },
  세부: {
    ko: '세부',
    en: 'Detail',
    zh: '详细',
    ja: '詳細',
  },
  기간: {
    ko: '기간',
    en: 'Period',
    zh: '时期',
    ja: '期間',
  },
  비고: {
    ko: '비고',
    en: 'Note',
    zh: '绩点',
    ja: '備考',
  },
  중앙대학교: {
    ko: '중앙대학교',
    en: 'Chung-Ang Univ.',
    zh: '首尔中央大学',
    ja: '中央大学',
  },
  학력_학위: {
    ko: '컴퓨터공학부 공학사 (심화이수)',
    en: 'BCompSc',
    zh: '计算机工程学士',
    ja: 'コンピューター工学部学士',
  },
  학력_기간: {
    ko: '2017.03 ~ 2022.02',
    en: 'Mar. 2017 - Feb. 2022',
    zh: '2017年3月～2022年2月',
    ja: '2017年3月～2022年2月',
  },
  학력_전체학점: {
    ko: '전체 학점: 4.1 / 4.5 (163 학점)',
    en: 'Total GPA: 4.1 / 4.5 (163 credits)',
    zh: '总体学分：4.1 / 4.5（163学分）',
    ja: '総合成績: 4.1 / 4.5（163単位）',
  },
  학력_전공학점: {
    ko: '전공 학점: 4.0 / 4.5 (89 학점)',
    en: 'Major GPA: 4.0 / 4.5 (89 credits)',
    zh: '专业学分：4.0 / 4.5（89学分）',
    ja: '専攻成績: 4.0 / 4.5（89単位）',
  },
  호남고등학교: {
    ko: '호남고등학교',
    en: 'Honam High School',
    zh: '湖南高级中学（韩国）',
    ja: '湖南高等学校',
  },
  호남고등학교_세부: {
    ko: '이과',
    en: 'Natural Sciences',
    zh: '理科',
    ja: '理系',
  },
  호남고등학교_기간: {
    ko: '2014.03 ~ 2017.02',
    en: 'Mar. 2014 - Feb. 2017',
    zh: '2014年3月～2017年2月',
    ja: '2014年3月～2017年2月',
  },
  호남고등학교_성적: {
    ko: '평균 내신: 1.45',
    en: 'Grade Average: 1.45',
    zh: '平均成绩：1.45',
    ja: '平均成績: 1.45',
  },
  화산중학교: {
    ko: '화산중학교',
    en: 'Hwasan Middle School',
    zh: '华山中学校（韩国）',
    ja: '華山中学校',
  },
  기숙형자율학교: {
    ko: '기숙형 자율학교',
    en: 'Boarding, Autonomous',
    zh: '寄宿制教育',
    ja: '寄宿型自律学校',
  },
  화산중학교_기간: {
    ko: '2011.03 ~ 2014.02',
    en: 'Mar. 2011 - Feb. 2014',
    zh: '2011年3月～2014年2月',
    ja: '2011年3月～2014年2月',
  },
  화산중학교_성적: {
    ko: '졸업 등수: 전교 4등 (남자 수석)',
    en: 'Graduation Rank: 4th overall',
    zh: '毕业排名：全校第4名（男生第1名）',
    ja: '卒業順位: 全校4位（男子首席）',
  },
}
